const ru = {
  navigation: {
    home: "Главная",
    portfolio: "Портфолио",
    about: "Обо мне",
    skill: "Навыки",
    contact: "Контакты",
  },

  home: {
    aboutCodeDna:
      "CodeDNA — воплощение ваших идей в жизнь с помощью современных веб-технологий и инновационных решений",
    about: "Обо мне",
  },

  about: {
    about: "Обо мне",
    aboutMe:
      "Привет! Я frontend-разработчик, увлечённый созданием современных веб-приложений. Основное внимание уделяю экосистеме Vue.js, а также обладаю прочным опытом работы с JavaScript, HTML и CSS. В реальных проектах эффективно использую Pinia для управления состоянием, Axios для интеграции с API, Ant Design Vue для построения пользовательских интерфейсов и Sass для оптимизированной стилизации. Подробнее",
    more: "Ещё",
  },

  skill: {
    mySkill: "Мои навыки",

    webDeveloper: {
      name: "Веб-разработчик",
      description:
        "Имею опыт создания веб-сайтов с использованием HTML, CSS, JavaScript, Vue.js и других современных веб-технологий",
    },

    mobileDeveloper: {
      name: "Мобильный разработчик",
      description:
        "Имею опыт разработки мобильных приложений с использованием Vue.js, Sass и Capacitor",
    },

    library: {
      name: "Библиотеки",
      description:
        "Одна из основных библиотек во Vue.js — Pinia, с её помощью я управляю глобальными данными во всех компонентах",
    },
  },

  portfolio: {
    starboi: {
      name: "STARBOI",
      description:
        "STARBOI — идеальное сочетание креативности и технического мастерства. Этот сайт-портфолио демонстрирует подход Starboi к искусству монтажа через современный дизайн и интуитивно понятный интерфейс. На сайте представлены его лучшие работы, креативные видеопроекты и предоставляемые услуги. Каждая страница — это демонстрация мастерства, оригинального мышления и рассказ в движении.",
    },

    maximus: {
      name: "MAXIMUS",
      description:
        "MAXIMUS — современный и надёжный веб-сайт, разработанный для компании, специализирующейся на услугах, связанных с лошадьми. Сайт предоставляет пользователям полную информацию о деятельности компании, видах услуг, уходе за лошадьми, тренировках и способах связи.",
    },

    weather: {
      name: "WEATHER APP",
      description:
        "WEATHER — современное приложение, предоставляющее данные о погоде в реальном времени через простой, точный и красивый интерфейс. Пользователи могут быстро получать информацию о текущих погодных условиях, температуре, влажности, скорости ветра и прогнозе на 7 дней. Приложение разработано с минималистичным дизайном, удобным интерфейсом и адаптивной (мобильной) структурой.",
    },

    postroy: {
      name: "POSTROY LANDING",
      description:
        "POSTROY LANDING — функциональный и визуально продуманный сайт, созданный для надёжной и современной компании по продаже строительных материалов. Сайт позволяет пользователям просматривать каталог продукции, цены, описания и быстро оформлять заказы. Дизайн выполнен в строгом, вызывающем доверие стиле и отражает профессиональный корпоративный имидж.",
    },

    savdoX: {
      name: "Savdo X",
      description:
        "SAVDO X — это онлайн-рынок веб-технологий. Наши продавцы могут удобно размещать свои товары на нашей платформе, а покупатели — приобретать их, не выходя из дома. На нашей платформе полностью обеспечивается безопасность как покупателей, так и продавцов.",
    },

    seeProject: "Посмотреть проект",
  },

  contact: {
    readyConnect: "ГОТОВ К СВЯЗИ!",
    nameInput: "Ваше имя",
    numberInput: "Ваш номер",
    messageInput: "Ваше сообщение",
    sendBtn: "Отправить",

    warn: {
      lettersWarn: "Введите имя буквами",
      fullName: "Пожалуйста, введите полное имя",
      trueNumber: "Введите корректный номер",
      fullNumber: "В сообщении недостаточно цифр!",
    },

    error: {
      failedMessage: "Не удалось отправить сообщение",
      ErrorServer: "Не удалось подключиться к серверу",
      invalidRequest: "На сервер отправлены некорректные данные",
    },

    sending: "Отправляется...",
    sendedMessage: "Сообщение отправлено. Пожалуйста, дождитесь моего ответа",
  },
};

export default ru;
